Repository: wp-plugins/purify-wp-menues
Catalog: languages/purify_wp_menues-*.po
Languages: de_de

source: Purify WP Menues Options
de_de: Einstellungen für Purify WordPress Menues

source: Special Settings
de_de: Besondere Einstellungen

source: Current Page Navigation Menu Items
de_de: Elemente im Navigationsmenü der aktuellen Seite

source: Current Page Parent Menu Items
de_de: Elemente im Navigationsmenü, die Eltern der aktuellen Seite sind

source: Current Page Ancestor Menu Items
de_de: Elemente im Navigationsmenü, die Vorfahren der aktuellen Seite sind

source: Site Front Page Menu Items
de_de: Elemente im Navigationsmenü der Startseite

source: All Other Navigation Menu Items
de_de: Alle anderen Elemente in Navigationsmenüs

source: Page Menu Items
de_de: Elemente im Seitenmenü

source: Print #menu-item-{id}.
de_de: Gebe #menu-item-{id} an.

source: The id of the menu item is added to every menu item of navigation memues.
de_de: Die ID des Menüelements wird bei jedem Element in Navigationsmenüs angegeben.

source: Maintain backward compatibility with wp_page_menu().
de_de: Rückwärtskompatibilität mit wp_page_menu() beibehalten.

source: Adds the CSS classes of page menues to navigation menues.
de_de: Fügt die CSS-Klassen von Seitenmenüs in Navigationsmenüs hinzu.

source: Do not print parent as ancestor.
de_de: Gebe Elternelemente nicht als Vorfahren an.

source: Does not classified the menu item which is the current parent as anchestor.
de_de: Gibt das Menüelement, das Eltern der aktuellen Seite ist, nicht auch als Vorfahr an.

source: Print .current-menu-ancestor.
de_de: Gebe .current-menu-ancestor an.

source: This class is added to menu items that correspond to a hierarchical ancestor of the currently rendered page.
de_de: Diese Klasse wird bei Menüelementen, die Vorfahren der aktuellen Seite sind, angegeben.

source: Print .current-menu-item.
de_de: Gebe .current-menu-item an.

source: This class is added to menu items that correspond to the currently rendered page.
de_de: Diese Klasse wird bei Menüelementen, die zur aktuellen Seite gehören, angegeben.

source: Print .current-menu-parent.
de_de: Gebe .current-menu-parent an.

source: This class is added to menu items that correspond to the hierarchical parent of the currently rendered page.
de_de: Diese Klasse wird bei Menüelementen, die Eltern der aktuellen Seite sind, angegeben.

source: Print .current-{object}-ancestor.
de_de: Gebe .current-{object}-ancestor an.

source: This class is added to menu items that correspond to a hierachical ancestor of the currently rendered object, where {object} corresponds to the the value used for .menu-item-object-{object}.
de_de: Diese Klasse wird bei Menüelementen, die Vorfahren des aktuellen Objekts sind, angegeben. {object} ist identisch mit dem Wert bei .menu-item-object-{object}.

source: Print .current-{object}-parent.
de_de: Gebe .current-{object}-parent an.

source: This class is added to menu items that correspond to the hierachical parent of the currently rendered object, where {object} corresponds to the the value used for .menu-item-object-{object}.
de_de: Diese Klasse wird bei Menüelementen, die Eltern des aktuellen Objekts sind, angegeben. {object} ist identisch mit dem Wert bei .menu-item-object-{object}.

source: Print .current_page_item.
de_de: Gebe .current_page_item an.

source: This class is added to page menu items that correspond to the currently rendered static page.
de_de: Diese Klasse wird in Seitenmenüs bei Menüelementen, die zur aktuellen Seite gehören, angegeben.

source: Print .current_page_parent.
de_de: Gebe .current_page_parent an.

source: This class is added to page menu items that correspond to the hierarchical parent of the currently rendered static page.
de_de: Diese Klasse wird in Seitenmenüs bei Menüelementen, die Eltern der aktuellen Seite sind, angegeben.

source: Print .current_page_ancestor.
de_de: Gebe .current_page_ancestor an.

source: This class is added to page menu items that correspond to a hierarchical ancestor of the currently rendered static page.
de_de: Diese Klasse wird in Seitenmenüs bei Menüelementen, die Vorfahren der aktuellen Seite sind, angegeben.

source: Print .current-{type}-ancestor.
de_de: Gebe .current-{type}-ancestor an.

source: This class is added to menu items that correspond to a hierachical ancestor of the currently rendered type, where {type} corresponds to the the value used for .menu-item-type-{type}.
de_de: Diese Klasse wird bei Menüelementen, die Vorfahren des aktuellen Seitentyps sind, angegeben. {type} ist identisch mit dem Wert bei .menu-item-type-{type}.

source: Print .current-{type}-parent.
de_de: Gebe .current-{type}-parent an.

source: This class is added to menu items that correspond to the hierachical parent of the currently rendered type, where {type} corresponds to the the value used for .menu-item-type-{type}.
de_de: Diese Klasse wird bei Menüelementen, die Eltern des aktuellen Seitentyps sind, angegeben. {type} ist identisch mit dem Wert bei .menu-item-type-{type}.

source: Print .menu-item.
de_de: Gebe .menu-item an.

source: This class is added to every menu item.
de_de: Diese Klasse wird bei jedem Menüelement angegeben.

source: Print .menu-item-home.
de_de: Gebe .menu-item-home an.

source: This class is added to menu items that correspond to the site front page.
de_de: Diese Klasse wird bei Menüelementen, die zur Startseite gehören, angegeben.

source: Print .menu-item-{id}.
de_de: Gebe .menu-item-{id} an.

source: This class with the item id is added to every menu item.
de_de: Diese Klasse wird bei jedem Menüelement in Navigationsmenüs mit der ID des Elements angegeben.

source: Print .menu-item-object-{object}.
de_de: Gebe .menu-item-object-{object} an.

source: This class is added to every menu item, where {object} is either a post type or a taxonomy.
de_de: Diese Klasse wird bei jedem Menüelement angegeben. {object} ist entweder ein Post Type oder eine Taxonomie.

source: Print .menu-item-object-category.
de_de: Gebe .menu-item-object-category an.

source: This class is added to menu items that correspond to a category.
de_de: Diese Klasse wird bei jedem Memüelement, das zu einer Kategorie gehört, angegeben.

source: Print .menu-item-object-{custom}.
de_de: Gebe .menu-item-object-{custom} an.

source: This class is added to menu items that correspond to a custom post type or a custom taxonomy.
de_de: Diese Klasse wird bei jedem Memüelement, das zu einem selbst erstellten Post Type oder einer selbst erstellten Taxonomie gehört, angegeben.

source: Print .menu-item-object-page.
de_de: Gebe .menu-item-object-page an.

source: This class is added to menu items that correspond to static pages.
de_de: Diese Klasse wird bei Menüelementen, die zu einer statischen Seite gehören, angegeben.

source: This class is added to menu items that correspond to a tag.
de_de: Diese Klasse wird bei Menüelementen, die zu einem Schlagwort gehören, angegeben.

source: Print .menu-item-type-post_type.
de_de: Gebe .menu-item-type-post_type an.

source: This class is added to menu items that correspond to post types, i.e. static pages or custom post types.
de_de: Diese Klasse wird bei Menüelementen, die zu einem Post Type gehören, hinzugefügt. Post Types sind z.B. statische Seiten oder selbst erstellte Post Types.

source: Print .menu-item-type-taxonomy.
de_de: Gebe .menu-item-type-taxonomy an.

source: This class is added to menu items that correspond to taxonomies, i.e. categories, tags, or custom taxonomies.
de_de: Diese Klasse wird bei Menüelementen, die zu einer Taxonomie gehören, hinzugefügt. Taxonomien sind z.B. Kategorien, Schlagwörter oder selbst erstellte Taxonomien.

source: Print .page_item.
de_de: Gebe .page_item an.

source: This class is added to page menu items that correspond to a static page.
de_de: Diese Klasse wird in Seitenmenüs bei Menüelementen, die zu einer statischen Seite gehören, angegeben.

source: Print .page-item-{id}.
de_de: Gebe .page-item-{id} an.

source: This class is added to page menu items that correspond to a static page, where ID is the static page ID.
de_de: Diese Klasse wird in Seitenmenüs bei Menüelementen, die zu einer statischen Seite gehören, angegeben. {id} ist die ID der statischen Seite.

source: In this section you control some basic settings.
de_de: In diesem Abschnitt gibst du einige Grundeinstellungen an.

source: In this section you control the CSS class Wordpress adds to the current menu item.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress zu aktuellen Menüelementen hinzufügt, an.

source: In this section you control the CSS classes Wordpress adds to the hierarchical parent of the current menu item.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress zu übergeordneten Eltern des aktuellen Menüelements hinzufügt, an.

source: In this section you control the CSS classes Wordpress adds to the hierarchical anchestors of the current menu item.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress zu übergeordneten Vorfahren des aktuellen Menüelements hinzufügt, an.

source: In this section you control the CSS class Wordpress adds to the menu item of the front page.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress zu Menüelementen der Startseite hinzufügt, an.

source: In this section you control all other classes Wordpress adds to menu items.
de_de: In diesem Abschnitt gibst du alle anderen CSS-Klassen, die Wordpress zu Menüelementen hinzufügt, an.

source: In this section you control the CSS classes Wordpress adds to items in a page menu via wp_page_nav(). Menues via wp_nav_menu() only have this classes if the backward compatibility option is checked.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress Elementen eines Seitenmenüs mit wp_page_nav() hinzufügt, an. Mit wp_nav_menu() erstellte Menüs enthalten diese Klassen nur, wenn die Rückwärtskompatibilität aktiviert wurde.

source: In this section you control the CSS class Wordpress adds to the hierarchical parent of the current item in a page menu.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress zum übergeordneten Elternteil des aktuellen Menüelements hinzufügt, an.

source: In this section you control the CSS class Wordpress adds to the hierarchical anchestors of the current item in a page menu.
de_de: In diesem Abschnitt gibst du die CSS-Klassen, die Wordpress zu übergeordneten Vorfahren des aktuellen Menüelements hinzufügt, an.

source: In this section you control all other classes Wordpress adds to items in a page menu.
de_de: In diesem Abschnitt gibst du alle anderen CSS-Klassen, die Wordpress Elementen eines Seitenmenüs hinzufügt, an.

source: The plugin Purify WordPress Menues requires WordPress version 3.0.0 or higher. Therefore, WordPress did not activate it. If you want to use this plugin update the Wordpress files to the latest version.
de_de: Das Plugin Purify WP Menues erfordert WordPress Version 3.0.0 oder höher. WordPress hat es daher nicht aktiviert. Falls du das Plugin nutzen willst, aktualisiere die Wordpress-Dateien auf die neueste Version.
